{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 10, "input_dim": 10, "dtype": "float32", "batch_input_shape": [null, 10], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "activity_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "embeddings_constraint": null, "name": "embedding_1", "embeddings_regularizer": null}}, {"class_name": "Conv1D", "config": {"activity_regularizer": null, "strides": [1], "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "activation": "relu", "filters": 128, "dilation_rate": [1], "padding": "same", "kernel_constraint": null, "name": "conv1d_1", "kernel_size": [5], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "name": "max_pooling1d_1", "trainable": true, "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"activity_regularizer": null, "strides": [1], "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "activation": "relu", "filters": 98, "dilation_rate": [1], "padding": "same", "kernel_constraint": null, "name": "conv1d_2", "kernel_size": [5], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "name": "max_pooling1d_2", "trainable": true, "pool_size": [2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "units": 250, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "units": 1, "name": "dense_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "theano", "keras_version": "2.1.3"}