{"backend": "theano", "keras_version": "2.1.3", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_constraint": null, "input_dim": 9515, "input_length": 140, "embeddings_regularizer": null, "dtype": "float32", "mask_zero": false, "name": "embedding_1", "trainable": true, "batch_input_shape": [null, 140], "output_dim": 100, "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}}}, {"class_name": "Conv1D", "config": {"kernel_size": [5], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "padding": "valid", "filters": 128, "name": "conv1d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "dilation_rate": [1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"strides": [5], "trainable": true, "padding": "valid", "pool_size": [5], "name": "max_pooling1d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"kernel_size": [5], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "padding": "valid", "filters": 128, "name": "conv1d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "dilation_rate": [1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"strides": [5], "trainable": true, "padding": "valid", "pool_size": [5], "name": "max_pooling1d_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "units": 128, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "units": 2, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}]}