{"class_name": "Sequential", "keras_version": "2.1.3", "config": [{"class_name": "Embedding", "config": {"embeddings_constraint": null, "input_length": 140, "output_dim": 100, "batch_input_shape": [null, 140], "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "mask_zero": false, "name": "embedding_1", "dtype": "float32", "activity_regularizer": null, "embeddings_regularizer": null, "input_dim": 4422}}, {"class_name": "Conv1D", "config": {"strides": [1], "bias_constraint": null, "filters": 128, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv1d_1", "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [5], "dilation_rate": [1]}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "pool_size": [5], "padding": "valid", "trainable": true, "strides": [5]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.5, "seed": null}}, {"class_name": "Conv1D", "config": {"strides": [1], "bias_constraint": null, "filters": 128, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv1d_2", "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [5], "dilation_rate": [1]}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "pool_size": [5], "padding": "valid", "trainable": true, "strides": [5]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "use_bias": true, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "name": "dense_1", "activation": "relu", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "use_bias": true, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "name": "dense_2", "activation": "softmax", "activity_regularizer": null}}], "backend": "theano"}